# Задача 22: Даны два неупорядоченных набора целых чисел (может быть, с повторениями).
# Выдать без повторений в порядке возрастания все те числа, которые встречаются в обоих наборах.
# Пользователь вводит 2 числа. n — кол-во элементов первого множества.
# m — кол-во элементов второго множества. Затем пользователь вводит сами элементы множеств.

n = int(input("Введите n "))
m = int(input("Введите m "))
n1 = set()
m1 = set()
for i in range(n):
    n1.add(int(input()))
for i in range(m):
    m1.add(int(input()))
print(sorted(n1.union(m1)))